package day02;

/*
 1.
 	*****
 	*****
 	*****
 	*****
 	*****
 	
 	--------------------
 2.
	*
	**
	***
	****
	*****
	
 	--------------------
 3.
 	
	    *
	   **
	  ***
	 ****
	*****
	
	----------------------
4.
 	*****
 	****
 	***
 	**
	*
	
	----------------------
5.
	*****
	 ****
	  ***
	   **
	    *
	
	----------------------
6.
	
	   *
	  ***
	 *****
	*******
	 *****
	  ***
	   *
	
 */
public class Test14 {

	public Test14() {
		for(int i = 0; i < 5; i++ ) {
			for(int j = 0 ; j < 5 ; j++ ) {
				System.out.print("*");
			}
			
			System.out.println();
		}
		
//		System.out.println(i); 
		// for 문 안의 변수 i는 for 반복문에 포함되어 있는 변수이다.
		// 따라서 for 명령을 빠져나가는 순간 사용할 수 없다.
	}

	public static void main(String[] args) {
		new Test14();
	}

}
