package day05;

/*
	5명의 학생의 점수를 관리할 배열을 만드는데
	배열에는 정수형으로 데이터를 저장할 것이다.
	그런데 각 학생들의 정보는 학생번호, 국어, 영어, 수학, 과학, 사회 의 점수를 랜덤하게 만들어서 입력하고
	총점을 구해서 입력할 예정이다.
	
	학생의 이름은 문자열 배열을 별도로 만들어서 저장할 예정이다.
	
	배열을 만들고 출력하세요.
	
		출력 예]
			홍길동 : 50 | 70 | 80 | 90 | 40 | ####(총점)
			
	======================================================================================
	위 문제가 해결이 되면 평균도 구해서 출력하세요	
	
	======================================================================================
	석차도 구해서 정렬하고 출력하세요.
	
 */
public class Ex01 {

	public Ex01() {
		
	}

	public static void main(String[] args) {
		new Ex01();
	}

}
